# Numpy Array vs List

In [194]:
import numpy as np
arr = np.array([1,2,3,4,5])

In [2]:
arr

array([1, 2, 3, 4, 5])

In [3]:
arr[0]

1

In [4]:
arr[1]

2

In [5]:
arr[0:4]

array([1, 2, 3, 4])

In [6]:
arr[-1]

5

In [7]:
type(arr)

numpy.ndarray

In [8]:
arr.ndim

1

In [9]:
arr.shape

(5,)

In [10]:
arr2 = np.array([1,2,3,4,5,'hello','hi'])

In [11]:
arr2

array(['1', '2', '3', '4', '5', 'hello', 'hi'], dtype='<U21')

In [12]:
import sys
sys.getsizeof(list())

64

In [13]:
sys.getsizeof(np.array([]))

96

In [14]:
sys.getsizeof([1,2,3,4,5,6,7,8,9,10])

144

In [15]:
sys.getsizeof(np.array([1,2,3,4,5,6,7,8,9,10]))

176

In [16]:
list1 = [i for i in range(10000)]

In [17]:
sys.getsizeof(list1)

87624

In [18]:
sys.getsizeof(np.array(list1))

80096

# Ways to create array

In [19]:
np.array([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [20]:
np.array(range(1,101))

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100])

In [21]:
np.array([i for i in range(1,101) if i % 2 == 0])

array([  2,   4,   6,   8,  10,  12,  14,  16,  18,  20,  22,  24,  26,
        28,  30,  32,  34,  36,  38,  40,  42,  44,  46,  48,  50,  52,
        54,  56,  58,  60,  62,  64,  66,  68,  70,  72,  74,  76,  78,
        80,  82,  84,  86,  88,  90,  92,  94,  96,  98, 100])

In [22]:
np.arange(1,101,3)

array([  1,   4,   7,  10,  13,  16,  19,  22,  25,  28,  31,  34,  37,
        40,  43,  46,  49,  52,  55,  58,  61,  64,  67,  70,  73,  76,
        79,  82,  85,  88,  91,  94,  97, 100])

In [23]:
np.linspace(1,100,num=20,endpoint=False,retstep=True)

(array([ 1.  ,  5.95, 10.9 , 15.85, 20.8 , 25.75, 30.7 , 35.65, 40.6 ,
        45.55, 50.5 , 55.45, 60.4 , 65.35, 70.3 , 75.25, 80.2 , 85.15,
        90.1 , 95.05]), 4.95)

In [24]:
np.random.random()

0.3675697851177927

In [25]:
np.random.random(10)

array([0.00792695, 0.48211498, 0.90444088, 0.39756478, 0.92970868,
       0.87148544, 0.30177149, 0.35173942, 0.13049065, 0.87150297])

In [26]:
np.random.rand()

0.2627420322051448

In [27]:
np.random.rand(10)

array([0.08221748, 0.42080685, 0.31291814, 0.99917071, 0.68180827,
       0.30038404, 0.93536622, 0.26564754, 0.44562323, 0.56974348])

In [49]:
np.random.randint(100,1000,10)

array([402, 912, 391, 304, 271, 810, 889, 479, 831, 577])

# Multi-dimensional array

In [195]:
ndarr = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])

In [196]:
ndarr

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [197]:
ndarr.shape

(3, 4)

In [198]:
ndarr.reshape(4,3)

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [201]:
arr2 = np.array([1,2,3,4,5,6])

In [202]:
arr2.reshape(3,2)

array([[1, 2],
       [3, 4],
       [5, 6]])

In [31]:
ndarr[0]

array([1, 2, 3, 4])

In [32]:
ndarr[1]

array([5, 6, 7, 8])

In [33]:
ndarr[-1]

array([ 9, 10, 11, 12])

In [34]:
ndarr.ndim

2

In [35]:
ndarr.shape

(3, 4)

In [36]:
ndarr[0:2]

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [37]:
ndarr[0:2,0:2]

array([[1, 2],
       [5, 6]])

In [38]:
ndarr[:,0:2]

array([[ 1,  2],
       [ 5,  6],
       [ 9, 10]])

In [53]:
np.random.random([10,10])

array([[3.75516911e-01, 5.80543946e-01, 8.74986111e-01, 4.06153654e-01,
        1.78683794e-01, 4.62940678e-02, 2.32908577e-01, 5.36481116e-02,
        8.21423554e-01, 7.33855435e-01],
       [2.41127932e-01, 5.87334516e-01, 8.49467401e-02, 6.44893840e-01,
        8.13234612e-01, 4.01495152e-01, 5.05451074e-01, 6.03547251e-01,
        7.85885986e-03, 9.12888746e-01],
       [9.61568131e-01, 6.76905887e-02, 3.68831504e-01, 8.82051056e-01,
        2.54685347e-01, 8.19424141e-01, 9.61196403e-01, 9.49724802e-01,
        4.87804155e-01, 4.60558192e-01],
       [9.77479191e-03, 2.98613339e-01, 8.66629544e-01, 4.97494860e-01,
        6.61209905e-01, 3.21274633e-04, 8.16204653e-01, 4.23140592e-01,
        1.83767270e-02, 8.30498488e-01],
       [6.36408074e-01, 7.15854681e-01, 8.41905721e-01, 3.36517024e-01,
        1.85006020e-01, 7.34773139e-01, 7.79625779e-01, 4.15457694e-01,
        6.45318626e-01, 1.56204372e-02],
       [8.80091649e-01, 2.78379933e-01, 6.04853858e-02, 8.80181296e-01,
        9.07320922e-01, 6.91927686e-01, 6.49404371e-01, 9.06857155e-01,
        6.51461883e-01, 4.95072507e-02],
       [3.98461308e-01, 9.23414779e-01, 1.49182114e-01, 6.71215075e-01,
        4.53773489e-01, 3.26714791e-01, 6.86050252e-01, 7.02000018e-01,
        4.09618256e-01, 3.89926724e-01],
       [4.93033641e-01, 8.42442192e-01, 7.50307530e-01, 3.62159693e-01,
        2.74356681e-01, 4.53454752e-01, 4.17736132e-01, 9.00164737e-01,
        4.35722546e-01, 9.53076929e-01],
       [3.20165772e-01, 3.87691722e-01, 5.26776324e-01, 2.46885214e-01,
        6.48751818e-01, 5.20819152e-02, 4.21026282e-01, 3.31542513e-01,
        8.58461859e-01, 9.16273636e-01],
       [5.95422041e-01, 6.44106511e-01, 5.82356851e-01, 3.30409694e-02,
        7.73410729e-01, 1.99016396e-01, 1.68631924e-01, 1.21133897e-01,
        1.88449918e-01, 8.84097829e-01]])

In [56]:
np.random.rand(2,5,5)

array([[[0.90362542, 0.29162579, 0.40728932, 0.46936739, 0.05579166],
        [0.0209413 , 0.84917345, 0.8102441 , 0.30642898, 0.32412898],
        [0.83810403, 0.41596319, 0.99849743, 0.9660532 , 0.51462145],
        [0.1682918 , 0.10471739, 0.55069989, 0.92985885, 0.71534118],
        [0.42223794, 0.62480421, 0.80733646, 0.20944726, 0.92512061]],

       [[0.0309217 , 0.37271136, 0.74168845, 0.45710925, 0.20271909],
        [0.34409383, 0.39331888, 0.84148931, 0.56436287, 0.68438372],
        [0.72505044, 0.81660501, 0.2140243 , 0.85563139, 0.95894339],
        [0.91119683, 0.48544465, 0.59002542, 0.14351167, 0.22841446],
        [0.51933126, 0.37915494, 0.29144619, 0.32316777, 0.76627664]]])

In [58]:
a = np.random.randint(10,100,[2,10])

In [59]:
a

array([[16, 42, 34, 85, 65, 70, 25, 43, 98, 88],
       [72, 10, 34, 48, 65, 74, 73, 82, 42, 30]])

In [60]:
a.shape

(2, 10)

In [158]:
np.random.seed(5)

In [159]:
np.random.random()

0.22199317108973948

In [160]:
np.random.random()

0.8707323061773764

In [161]:
np.random.random()

0.20671915533942642

In [162]:
np.random.random(10)

array([0.91861091, 0.48841119, 0.61174386, 0.76590786, 0.51841799,
       0.2968005 , 0.18772123, 0.08074127, 0.7384403 , 0.44130922])

In [163]:
np.random.random([2,5])

array([[0.15830987, 0.87993703, 0.27408646, 0.41423502, 0.29607993],
       [0.62878791, 0.57983781, 0.5999292 , 0.26581912, 0.28468588]])

In [168]:
arr1 = np.random.random(1000)

In [169]:
arr1.min()

0.00038289436747096506

In [171]:
arr1.max()

0.9985157672628341

In [172]:
arr1.mean()

0.4977658108714996

In [173]:
arr1.argmin()

197

In [175]:
arr1[197]

0.00038289436747096506

In [174]:
arr1.argmax()

278

In [176]:
arr1[278]

0.9985157672628341

In [187]:
arr1.argsort()

array([197, 757,   3, 521, 477,  11, 680, 859, 441, 613, 451, 269, 735,
       225,  56, 592, 168, 408, 867, 416, 970, 541, 669, 282,  64, 396,
         1, 865, 276, 718, 561, 256,  19, 123, 489, 969, 543,  34, 427,
       726, 279, 881, 674, 565, 981, 648, 357, 852, 785, 375, 962, 259,
       733, 921,  37, 425, 610,  69, 686, 558, 372, 945, 111,  97, 815,
       170, 332, 101, 737, 837, 916, 919, 283, 596, 943, 892, 166, 693,
       653, 258, 511, 794, 452, 607, 505, 863, 402, 251, 522,  80,  92,
       546, 103, 211,  20, 679, 435, 423, 883, 673,  32, 754, 472, 788,
       304, 506, 936,  51, 285, 944, 845, 118, 719, 973,  58,  21,  48,
       379, 922, 927, 709, 890, 585, 940, 187, 761, 449, 347, 214, 950,
       438, 263, 532, 678, 598, 989, 147, 609, 149, 294, 245, 880, 895,
       996, 192, 793, 821, 631, 861, 848, 830, 990, 195, 586, 584, 641,
       816, 503, 493, 422, 176, 199, 823, 736, 803, 888, 559, 405, 169,
       398, 182, 105, 937, 804, 336, 731, 564, 525, 721, 637, 244, 374,
       889, 768, 186, 640, 548,  38, 429, 925, 390,  70, 229, 194, 106,
       310, 482, 949, 495, 825, 386, 215, 671, 249, 365, 428, 485, 464,
       134, 411, 591, 480, 246, 858, 491, 524, 533, 778, 946, 139, 218,
       307,  94, 684, 318, 499, 385, 740, 894, 275, 782, 212, 567, 975,
       904,  93, 625, 439, 122, 102, 659,  40, 432, 165, 400, 614,  22,
       518, 905, 378, 461, 787, 762, 321, 232,   7, 642, 742, 100, 224,
       146, 418, 498, 621, 395, 599, 769, 783, 753, 842, 987, 749, 701,
       677, 287, 826, 575, 171, 399, 257, 734, 573, 714, 290, 646, 603,
       233, 373, 338, 323, 394, 286, 571, 707, 335, 487, 209, 148, 114,
       241, 164, 965, 722, 150, 530, 142, 325, 523, 415, 687, 712, 601,
       998, 658,  79, 250, 759,  73, 626, 403, 207, 756, 337, 781, 376,
       330, 354, 926, 629,  50, 635, 410, 167, 172, 272, 692, 242, 553,
        42, 682, 577, 496, 161, 790, 274, 911, 440, 436, 562,  74,  33,
       339,  95, 633, 597, 786, 125, 612, 264, 143,  39, 497, 531, 492,
       319, 697, 887, 667, 305, 942, 248,  55, 217,  91, 273, 512, 908,
       605, 317, 939, 205, 355, 730,  52, 750, 985, 724, 367, 732, 914,
       314, 665, 832, 899, 443, 745, 958, 448,  14, 725, 765, 844, 426,
       196,  77, 604, 797, 465,  66, 977, 812, 569, 128, 893, 343, 563,
       141, 450, 668, 387, 407, 545, 809, 140, 234, 716, 841, 560, 507,
       270, 266, 813, 727, 473, 252, 961, 660, 213, 296, 729, 713, 360,
       643, 857, 254, 392, 831,  62, 255, 414, 334,  98, 583, 978,  71,
       694, 582, 127, 555, 302, 690, 992, 331,  12, 289, 715, 463, 382,
       240, 619, 120, 951, 536, 900, 647, 144,  59, 814, 855, 303,  18,
       528, 328, 534, 953, 516, 717, 381,  44, 843, 434, 622, 133, 206,
       179, 986, 885, 369, 789, 948, 326, 877, 670, 954, 971, 602, 181,
       915,  53, 419, 350,  61, 744,   4, 634, 454, 675, 664, 891, 698,
       333, 654, 711, 284, 808, 445, 792,  81, 130, 457, 739, 628, 471,
       824, 773, 851, 593, 903, 972, 924, 798, 780, 984, 572, 935, 145,
       784, 624, 124, 281, 504,  35,  16, 685, 155, 226, 906, 873, 526,
       947, 828, 469, 154, 879, 909,  26, 510, 795, 703, 959, 728, 113,
       235,  65, 820, 220, 501, 406,   2, 872, 119, 934, 201, 271, 606,
        45, 466, 913, 917, 359, 433, 884, 345, 869, 237, 349, 159, 695,
       109, 173, 508, 356, 203, 655, 152, 652, 689, 938, 135, 163, 160,
       409, 801, 764, 994, 849, 590, 741, 681, 158, 519, 661, 656, 579,
       811, 952, 752, 630, 329, 175, 552, 420, 581, 923,  24, 700, 129,
       864, 221, 230, 817, 993, 566,  27, 361, 444,  43, 527,   5, 183,
       651, 156, 902, 180, 968, 617, 920, 743, 854, 983, 800, 121, 320,
       708, 299, 364, 239, 312, 447, 116, 775,  82, 639, 847, 963, 247,
       710, 751, 588, 706, 370, 767, 576, 600, 476, 151, 929, 404, 836,
       478, 578, 747, 383, 931, 822, 391, 818, 928, 875, 999, 758, 542,
       723, 840, 554, 474, 529, 568,  88, 772,  72, 997, 777, 227, 991,
        87, 481, 223, 261, 650, 967, 509, 995, 901, 293, 866, 298, 839,
       960, 157, 458, 417, 178, 896, 277, 760, 556, 513, 456, 200, 898,
       834, 632, 982, 208, 616, 431, 663, 666, 957, 500, 829, 136, 308,
       190, 437, 421, 475, 544, 490, 137, 315, 348, 351,  86, 191, 976,
       520, 324, 311, 483, 300,  89,  85, 202, 185,  17, 539, 846, 580,
       442, 502, 424, 174, 649, 243, 162, 540, 446, 796,   0, 838, 550,
       645, 297, 907, 455, 132, 966, 876, 870, 912, 595, 860,  41,  36,
       862, 897, 210, 696,  63,  68,   8, 933, 363, 228, 799, 705, 309,
       470, 806, 494, 104, 615, 340, 941, 108,  96, 253, 301,  28, 193,
        99,  15, 886, 107, 358,  25, 384, 979, 683, 835,  31, 618, 115,
       535, 755, 486, 623, 453, 262, 353, 918, 352, 704, 956, 413, 430,
       216, 882,  49, 316, 198, 219, 388,  60, 662, 720, 766, 636, 322,
       280,  57, 627, 260, 638, 964,   9, 827, 397, 327, 779, 393, 791,
       770, 488, 537, 819, 306, 371, 238, 699, 222, 467, 295, 126,  83,
       802, 177, 341, 868, 657, 570, 344,  78, 468, 746, 589, 368, 515,
       688, 462, 611, 189, 774,  30, 763, 265, 110, 342, 377, 932, 620,
       955,  75, 401, 551,  10, 871, 267,  29, 389, 874, 738, 587, 188,
       547, 691, 702, 988, 517, 484, 771, 538, 291, 231,  46, 776, 380,
        47, 459, 644, 805, 748, 460, 574, 850, 514, 856, 810,  76, 557,
       362, 549,  54, 131, 268, 204, 930,  23, 112,  84, 672, 292, 853,
       288, 366, 974, 594, 980,  90, 412, 313, 833, 807, 479,  13, 676,
        67,   6, 117, 184, 910, 236, 138, 608, 878, 346, 153, 278])

In [177]:
arr2 = np.random.random([10,10])

In [178]:
arr2.argmin()

53

In [185]:
arr2[5][3]

0.010188654525792318

In [186]:
arr2.min()

0.010188654525792318

In [189]:
arr3 = np.array([[13,34,42,32], [34,43,76,23]])

In [ ]:
arr3.sort()

In [192]:
arr3

array([[13, 32, 34, 42],
       [23, 34, 43, 76]])

# Pandas Intro

In [134]:
dict1 = {
    'a' : ['Pant', 'Dhoni', 'Kohli', 'Rohit', 'Hardik', 'Bumrah', 'Chahal'],
    'b' : [30, 50, 70, 100, 50, None, None],
    'c' : [23.3, 49, 52, 54, 40, None, None]
}

In [98]:
import pandas as pd

In [135]:
df = pd.DataFrame(dict1)

In [136]:
#2d - dataframe - set of series
df

        a      b     c
0    Pant   30.0  23.3
1   Dhoni   50.0  49.0
2   Kohli   70.0  52.0
3   Rohit  100.0  54.0
4  Hardik   50.0  40.0
5  Bumrah    NaN   NaN
6  Chahal    NaN   NaN

In [76]:
#1D - series
#df[['names']]
#pd.DataFrame(df['names'])
df[['names', 'average']]

    names  average
0    Pant     23.3
1   Dhoni     49.0
2   Kohli     52.0
3   Rohit     54.0
4  Hardik     40.0
5  Bumrah      NaN
6  Chahal      NaN

In [78]:
df[0:4]

   names  scores  average
0   Pant    30.0     23.3
1  Dhoni    50.0     49.0
2  Kohli    70.0     52.0
3  Rohit   100.0     54.0

In [80]:
df[0:1]

  names  scores  average
0  Pant    30.0     23.3

In [90]:
df[df['names'] == 'Pant']

  names  scores  average
0  Pant    30.0     23.3

In [93]:
df

    names  scores  average
0    Pant    30.0     23.3
1   Dhoni    50.0     49.0
2   Kohli    70.0     52.0
3   Rohit   100.0     54.0
4  Hardik    50.0     40.0
5  Bumrah     NaN      NaN
6  Chahal     NaN      NaN

In [95]:
df.head(4)

   names  scores  average
0   Pant    30.0     23.3
1  Dhoni    50.0     49.0
2  Kohli    70.0     52.0
3  Rohit   100.0     54.0

In [96]:
df.tail(2)

    names  scores  average
5  Bumrah     NaN      NaN
6  Chahal     NaN      NaN

In [100]:
df

        a      b     c
0    Pant   30.0  23.3
1   Dhoni   50.0  49.0
2   Kohli   70.0  52.0
3   Rohit  100.0  54.0
4  Hardik   50.0  40.0
5  Bumrah    NaN   NaN
6  Chahal    NaN   NaN

In [112]:
df = pd.DataFrame(dict1)

              Names  Scores  Average
Batsman        Pant    30.0     23.3
Batsman       Dhoni    50.0     49.0
Batsman       Kohli    70.0     52.0
Batsman       Rohit   100.0     54.0
All-rounder  Hardik    50.0     40.0
Bowler       Bumrah     NaN      NaN
Bowler       Chahal     NaN      NaN

                c       a      b
Batsman      23.3    Pant   30.0
Batsman      49.0   Dhoni   50.0
Batsman      52.0   Kohli   70.0
Batsman      54.0   Rohit  100.0
All-rounder  40.0  Hardik   50.0
Bowler        NaN  Bumrah    NaN
Bowler        NaN  Chahal    NaN

In [ ]:
df.columns = ['Names', 'Scores', 'Average']
df.index = ['Batsman', 'Batsman', 'Batsman', 'Batsman', 'All-rounder', 'Bowler', 'Bowler']
df

In [ ]:
columns = ['c', 'a', 'b']
rows = ['Batsman', 'Batsman', 'Batsman', 'Batsman', 'All-rounder', 'Bowler', 'Bowler']
pd.DataFrame(dict1, index = rows, columns=columns)

In [127]:
list1 = [['Pant', 'Dhoni', 'Kohli', 'Rohit', 'Hardik', 'Bumrah', 'Chahal'],
        [30, 50, 70, 100, 50, None, None],
        [23.3, 49, 52, 54, 40, None, None]]

In [128]:
list1

[['Pant', 'Dhoni', 'Kohli', 'Rohit', 'Hardik', 'Bumrah', 'Chahal'],
 [30, 50, 70, 100, 50, None, None],
 [23.3, 49, 52, 54, 40, None, None]]

In [129]:
arr1 = np.array(list1)

In [137]:
arr1
pd.DataFrame(arr1)

      0      1      2      3       4       5       6
0  Pant  Dhoni  Kohli  Rohit  Hardik  Bumrah  Chahal
1    30     50     70    100      50    None    None
2  23.3     49     52     54      40    None    None

In [131]:
rows = ['names', 'scores', 'average']
columns = ['Batsman', 'Batsman', 'Batsman', 'Batsman', 'All-rounder', 'Bowler', 'Bowler']
df = pd.DataFrame(arr1, index=rows, columns = columns)

In [132]:
df.transpose()

              names scores average
Batsman        Pant     30    23.3
Batsman       Dhoni     50      49
Batsman       Kohli     70      52
Batsman       Rohit    100      54
All-rounder  Hardik     50      40
Bowler       Bumrah   None    None
Bowler       Chahal   None    None

In [133]:
df

        Batsman Batsman Batsman Batsman All-rounder  Bowler  Bowler
names      Pant   Dhoni   Kohli   Rohit      Hardik  Bumrah  Chahal
scores       30      50      70     100          50    None    None
average    23.3      49      52      54          40    None    None

In [138]:
df

        a      b     c
0    Pant   30.0  23.3
1   Dhoni   50.0  49.0
2   Kohli   70.0  52.0
3   Rohit  100.0  54.0
4  Hardik   50.0  40.0
5  Bumrah    NaN   NaN
6  Chahal    NaN   NaN

In [142]:
df.isna()

       a      b      c
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False   True   True
6  False   True   True

In [141]:
df.dropna()

        a      b     c
0    Pant   30.0  23.3
1   Dhoni   50.0  49.0
2   Kohli   70.0  52.0
3   Rohit  100.0  54.0
4  Hardik   50.0  40.0

In [193]:
df.describe()

                b          c
count    5.000000   5.000000
mean    60.000000  43.660000
std     26.457513  12.578871
min     30.000000  23.300000
25%     50.000000  40.000000
50%     50.000000  49.000000
75%     70.000000  52.000000
max    100.000000  54.000000

In [218]:
list1 = []

In [219]:
list2 = [1,2,3,4,5]

In [226]:
list1.append(list2)

In [229]:
np.array(list1)

array([list([1, 2, 3, 4, 5]), list([1, 2, 3, 4, 5]),
       list([1, 2, 3, 4, 5]), list([1, 2, 3, 4, 5]), list([])],
      dtype=object)

In [228]:
list1.append([])

In [214]:
np.array(list1)

array([list([1, 2, 3, 4, 5]), list([1, 2, 3, 4, 5]),
       list([1, 2, 3, 4, 5]), list([1, 2, 3, 4, 5]), list([])],
      dtype=object)